// 35：复杂链表的复制.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
/*
*输入一个复杂链表（每个节点中有节点值，以及两个指针，一个指向下一个节点，
*(另一个特殊指针指向任意一个节点），返回结果为复制后复杂链表的head。
*（注意，输出结果中请不要返回参数中的节点引用，否则判题程序会直接返回空）
*/

#include "pch.h"
#include <iostream>

int main()
{
    std::cout << "Hello World!\n"; 
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
